Revit 2027 API
BuiltInFailures.ElectricityFailures.FamilyMismatchCircuitDisconnected Property
 The family no longer matches the properties for the Circuit. Disconnect the family from the Circuit?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilyMismatchCircuitDisconnected { get; }
Public Shared ReadOnly Property FamilyMismatchCircuitDisconnected As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilyMismatchCircuitDisconnected {
	FailureDefinitionId^ get ();
}
static member FamilyMismatchCircuitDisconnected : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricityFailures Class
Autodesk.Revit.DB Namespace